Courses/7140/Lectures/Languages/Java/java8-lambda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lambda Expressions of Java 8</title>
<!-- 2015-11-15 Sun 20:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Mateti: OO Programming and Design"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2015-11-09 | <a href="../../"> ../../</a> | <a hrefTBD="index-slides.html"> Slides </a>
</div>
<div id="content">
<h1 class="title">Lambda Expressions of Java 8</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Abstract</a></li>
<li><a href="#sec-2">2. Background</a></li>
<li><a href="#sec-3">3. Java8 Lambdas</a></li>
<li><a href="#sec-4">4. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
Lambda Expressions, method refs, functional interfaces, etc. of
Java 8.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Background</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> First Class Entities</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Entities: any "thing" that can be defined in the prog language
<ol class="org-ol">
<li>values of builtin types
</li>
<li>labels (targets of goto)
</li>
<li>functions, methods, a section of code
</li>
<li>type defs
</li>
</ol>
</li>

<li>First-Class entities can be: (i) passed as a parameter; (ii) returned from a
function; (iii) assigned to a variable;
</li>

<li>Second-Class entities can be: (i), not (ii), not (iii)
</li>

<li>Third-Class entities can be: none of (i) (ii) (iii)
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Lexical and Dynamic Scoping</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Consider the example below, 

<div class="org-src-container">

<pre class="src src-pseudo">int n := 123;               // written in pseudo code

define meenie() {
  print("meenie: " + n);
}

define minie(int n) {
  print("minie: " + n);
  meenie();                 // which n does this use?
}

print("main: " + n);
minie(456);
meenie();
</pre>
</div>
</li>

<li>main: 123 minie: 456 meenie: 123 meenie: 123  // lexical scoping
</li>
<li>main: 123 minie: 456 meenie: 456 meenie: 123  // dynamic scoping
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Closures</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>In a block, bound variables are those decalred within.  All others
(i.e., declared outside) are free variables.
</li>

<li>An environment is a table of triplets: the name of a variable, its
declaration, its current value.  Nested scopes give rise to a stack
of environments.
</li>

<li>A closure is a block of code that can be referenced and passed
around.  In general, it has free variables.  These free variables
are yield the values they have in that environment, regardless of
where this closure is evaluated.
</li>

<li>Def: Closures are procedure contexts as
first-class objects.
<ol class="org-ol">
<li>Define: first-class objects. See below.
</li>
<li>Define: procedure contexts. section of code 
</li>
</ol>
</li>

<li>Closures are a feature present in many (functional, as well as
procedural) languages.
</li>

<li>Java8 associates a closure with a lambda expression, paired with an
environment.  So the two terms are often used interchangeably in
the Java community. Other languages do not treat closures and
lambda expressions like so.
</li>

<li>If we use the above CS definition of what closures are, Java8 does
not have them.
</li>

<li><a href="https://en.wikipedia.org/wiki/Closure_(computer_programming)">https://en.wikipedia.org/wiki/Closure_(computer_programming)</a>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Java8 Lambdas</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Lambda Calculus</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Alonzo Church, the Lambda Calculus, 1936; Used the Greek &lambda; character
</li>
<li>Grammar: expr ::= &lambda; id : expr | expr expr | id | (expr)
</li>
<li>Lambda calculus is mathematically equivalent to Turing Machines.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Function Defs without Names</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Suppose we have <code>f(x, y)</code> defined as <code>(x + 1)*(y + 2)</code>.  
So, <code>f(3, 4)</code> is <code>24</code>.
</li>
<li>The anonymous version of f is: <code>lambda x, y: (x + 1)*(y + 2) ;</code>
</li>
<li>The <code>f(3, 4)</code> is written as <code>(lambda x, y: (x + 1)*(y + 2))(3, 4)</code>
</li>
<li>Function definition appears in-line with function-invocation.
</li>
<li>Another, but same, in-line def makes it another anonymous function
that we happen to know is the same.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Java8 Functional interfaces</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>A functional interface defines exactly one abstract method. 
</li>
<li><code>java.lang.Runnable</code><br  />
   <code>public abstract void run();</code>   abstract can be omitted
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Java8 Method References</h3>
<div class="outline-text-3" id="text-3-4">
<ol class="org-ol">
<li><a href="http://www.lambdafaq.org/what-are-method-references/">http://www.lambdafaq.org/what-are-method-references/</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Java8 Functions without Names</h3>
<div class="outline-text-3" id="text-3-5">
<ol class="org-ol">
<li><code>(int x, int y) -&gt; { return (x + 1)*(y + 2); }</code>
</li>

<li><code>(x, y) -&gt; { (x + 1)*(y + 2); }</code> as above but with inferred types
</li>

<li><code>x -&gt; { System.out.println(x); }</code> 
is an example of single parameter with inferred type on the left of
the arrow, and a block with no return value on the rhs.
</li>

<li>Without Lambda exp (No inputs)
<div class="org-src-container">

<pre class="src src-java">Runnable r1 = new Runnable() {
  public void run() {
    System.out.println("Running without Lambda");
  }
};
</pre>
</div>
</li>

<li>With Lambda exp  (No inputs)
<div class="org-src-container">

<pre class="src src-java">Runnable r2 = () -&gt; { System.out.println("Running with Lambda"); };
</pre>
</div>
</li>

<li>Selecting persons based on some criteria
<div class="org-src-container">

<pre class="src src-java">printPersons(
    roster, (Person p) -&gt;
        p.getGender() == Person.Sex.MALE &amp;&amp; p.getAge() &gt;= 18
);
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Lectured using these <a href="https://www.cs.cmu.edu/~charlie/courses/15-214/2014-fall/slides/26-java8.pdf">PDF slides</a> by www.cs.cmu.edu/~charlie.
"Lambdas and Streams in Java8", 2014.  Required Reading.
</li>

<li>Oracle.com, <a href="https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html">Lambda Expressions</a>, <a href="http://docs.oracle.com/javase/tutorial/java/javaOO/nested.html">Nested Classes</a>.  Recommended
Reading.
</li>

<li><a href="https://dzone.com/articles/dark-side-java-8">https://dzone.com/articles/dark-side-java-8</a> A critque. Recommended Reading.
</li>

<li><a href="http://www.lambdafaq.org/">http://www.lambdafaq.org/</a>  Reference
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
